#include <stdio.h>

/* Лабораторная работа №14. Вариант 2
   Задание: Составить программу ввода квадратной матрицы и печати в строку всех ее элементов в заданном ниже порядке следования (обхода)
   7  4  2  1
   11 8  5  3
   14 12 9  6
   16 15 13 10
   Студент группы М8О-101Б-22 Бычков А.*/

int main() {
	
	// n - размер матрицы; c - количество выведенных элементов матрицы (для прекращения цикла while); i - номер строки; j - номер столбца; key - ключ, отвечающий за то, где мы находимся, если он 		равен нулю, то мы выше главной диагонали, иначе, под главной диагональю.
	int n, c = 0, i, j, key = 0;
	printf("Введите размер матрицы: ");
	scanf("%d", &n);
	
	// Двумерный массив размер на 1 больше, чем n, чтобы решать задачу в индексации с единицы.
	int m[n+1][n+1];
	
	// Чтение данных в двумерный массив
	printf("Введите элементы матрицы:\n");
	for (int i = 1; i <= n; i++ ) {
		for (int j = 1; j <= n; j++ ) {
			scanf("%d", &m[i][j]);
		}
	}
	printf("Получившаяся строка: ");

	// Нанчинаем выводить с верхнего правого элемента
	i = 1;
	j = n;
	
	while ( c != n * n ) {
	
		c ++;
		printf("%d ", m[i][j]);
		
		
		// Если это нижний правый угол, то нужно переключиться и выводить элементы матрицы, под главной диагональю 
		if (i == j && j == n) {
			i = 2;
			j = 1;
			key = 1;
			continue;
		}
		
		// Вывод элементов над главной диагональю
		if (key == 0) {
			if (j == n) {
				j -= i;
				i = 1;
			} else {
				i ++;
				j ++;
			}
		}
		
		
		// Вывод элементов под гланвой диагональю
		if (key) {
			if (i == n) {
				i = n - j + 2;
				j = 1;
			} else {
				i ++;
				j ++;
			}
		}	
	}
	printf("\n");
}